[
  [
    "https://jobs.lever.co/palantir/e27af7ab-41fc-40c9-b31d-02c6cb1c505c",
    "Dear Hiring Manager at Palantir, I am excited to apply for the Forward Deployed Software Engineer role at Palantir, where I can utilize my technical skills and experience to help customers integrate and analyze their data. With a strong foundation in programming languages such as Java, Python, and C++, as well as experience with data integration, data modeling, and data analysis, I am confident in my ability to develop software applications that meet the needs of Palantir's customers. My experience as an Application Developer at ThoughtWorks has provided me with a solid understanding of software design patterns, and I have successfully engineered bill notifications and alerts within a distributed autopay platform using Spring Boot and Java. I have also optimized API response time for Stripe transactions and implemented Amazon OAuth for user registration and authentication. In addition to my technical skills, I possess strong communication and problem-solving skills, which have been demonstrated through my experience working with customers and internal stakeholders. I am excited about the opportunity to join Palantir's team and contribute to the company's mission of helping organizations make better decisions by providing them with the right data at the right time. Thank you for considering my application. I look forward to discussing my qualifications further."
  ],
  [
    "https://jobs.lever.co/palantir/7d69cf8a-06fd-4f05-bd84-27149db29c4d",
    "Dear Hiring Manager at Palantir,\n\nI am excited to apply for the Forward Deployed Software Engineer position at Palantir, where I can utilize my technical skills and experience to drive innovation and collaboration. With a strong background in software development, data integration, and analytics, I am confident that I would be an excellent fit for this role.\n\nAs a highly motivated and detail-oriented individual with a Master's in Computer Science from the University of Cincinnati, I possess a solid foundation in programming languages such as Java, Python, and C++. My experience as an Application Developer at ThoughtWorks has equipped me with the skills to engineer reliable, modular components, and boost customer experience through consistent payment reminders. I have also optimized API response time, implemented Redis Pub/Sub architecture, and reduced payment processing latency, demonstrating my ability to improve system performance and scalability.\n\nIn my previous roles, I have worked with various technologies, including Spring Boot, React, and PostgreSQL, and have experience with data visualization, machine learning, and software development lifecycle. My projects, such as GPT-From-Scratch and All-RAG-Techniques, showcase my ability to design and implement complex systems, including generative pre-trained transformers and retrieval-augmented generation pipelines.\n\nI am particularly drawn to Palantir's commitment to innovation and collaboration, and I am excited about the opportunity to work with a talented team to integrate and analyze customer data, develop and deploy software applications, and drive business growth. I am confident that my technical skills, passion for software development, and experience working with customers would make me a valuable asset to the Palantir team.\n\nThank you for considering my application. I would be thrilled to discuss my qualifications further and explore how I can contribute to Palantir's mission.\n\nSincerely,\nSupraja Srikanth"
  ],
  [
    "https://jobs.lever.co/palantir/2fb19022-bb65-4af8-b6fa-31beb345c140",
    "Dear Hiring Manager at Palantir,\n\nI am excited to apply for the Forward Deployed Software Engineer position at Palantir, where I can leverage my technical expertise and passion for data-driven insights to drive customer satisfaction. With a strong foundation in software development, data integration, and cloud computing, I am confident that my skills align with the role's requirements.\n\nAs a seasoned software engineer with experience in developing scalable and efficient systems, I am well-versed in designing and implementing data pipelines, building custom applications, and integrating data from various sources. My expertise in programming languages such as Java, Python, and JavaScript, as well as my familiarity with front-end and back-end technologies like React, Spring Boot, and Node.js, make me a strong fit for this role.\n\nIn my current role at ThoughtWorks, I have engineered bill notifications and alerts within a distributed autopay platform, leveraging software design patterns to build reliable and modular components. I have also architected a robust recurring mandate protocol, maximizing payment efficiency and diminishing payment failure rates. Additionally, I have optimized API response times, implemented Redis Pub/Sub architecture, and reduced database maintenance time by automating updates.\n\nI am particularly drawn to Palantir's mission to help organizations make better decisions through data-driven insights. As someone who is passionate about using technology to drive positive change, I appreciate the company's commitment to innovation, teamwork, and customer satisfaction. I am excited about the opportunity to work with a talented team of engineers and contribute to the development of cutting-edge data integration and analytics platforms.\n\nThank you for considering my application. I would welcome the opportunity to discuss my qualifications further and explore how my skills and experience align with the requirements of this role.\n\nSincerely,\nSupraja Srikanth"
  ],
  [
    "https://jobs.lever.co/palantir/bdcfb29f-4f27-42de-933f-7f83a359b9f0",
    "Dear Hiring Manager at Palantir, I am excited to apply for the Forward Deployed Software Engineer role at Palantir, where I can leverage my technical skills and passion for data-driven insights to drive innovation and customer success. With a strong foundation in computer science and experience in software development, data integration, and data analysis, I am confident in my ability to make a meaningful impact at Palantir. My experience as an Application Developer at ThoughtWorks has equipped me with the skills to engineer scalable and reliable software applications, and my proficiency in programming languages such as Java, Python, and JavaScript has allowed me to develop a wide range of software solutions. I am particularly drawn to Palantir's mission to help organizations make better decisions through data-driven insights, and I am excited about the opportunity to work with customers to integrate and analyze their data. My excellent communication and problem-solving skills, combined with my experience working with internal stakeholders and customers, make me a strong fit for this role. I am impressed by Palantir's commitment to innovation, teamwork, and continuous learning, and I am excited about the opportunity to be part of a global company that values these principles. Thank you for considering my application. I am excited to discuss my qualifications further and learn more about the team at Palantir. Sincerely, Supraja Srikanth"
  ],
  [
    "https://job-boards.greenhouse.io/point72/jobs/7297613002",
    "Dear Hiring Manager at Point72 Asset Management, I am excited to apply for the Data Scientist role at Point72 Asset Management, where I can leverage my technical skills and passion for machine learning to drive investment decisions. With a strong foundation in computer science and a Master's in Computer Science from the University of Cincinnati, I am confident in my ability to design, develop, and deploy models and tools to support portfolio managers, researchers, and other data scientists. My experience working with large datasets, programming skills in languages such as Python, and knowledge of machine learning algorithms make me a strong fit for this role. As a skilled software engineer with experience in companies like ThoughtWorks, KAS Commerce, and Amazon, I have developed excellent communication and collaboration skills, which I believe are essential for success in this position. I am particularly drawn to Point72's commitment to innovation, teamwork, and continuous learning, and I am excited about the opportunity to work in a dynamic and supportive work environment. I have attached my resume, which provides more details about my experience and skills. Thank you for considering my application. I look forward to the opportunity to discuss my qualifications further. Sincerely, Supraja Srikanth"
  ]
]