[
  [
    "https://jobs.lever.co/palantir/e27af7ab-41fc-40c9-b31d-02c6cb1c505c",
    "Dear Hiring Manager at Palantir,\n\nI am excited to apply for the Forward Deployed Software Engineer position at Palantir, where I can utilize my technical skills and experience to help organizations make better decisions by integrating, analyzing, and visualizing their data. With a strong foundation in software development, data integration, and cloud computing, I am confident that I would be a valuable asset to your team.\n\nAs a highly motivated and innovative individual with a Master's in Computer Science from the University of Cincinnati, I possess a unique combination of technical and soft skills that align with the requirements of this role. My experience in software development has equipped me with expertise in programming languages such as Python, Java, and JavaScript, as well as front-end and back-end technologies like React.js, Spring Boot, and Node.js. Additionally, I have worked with various databases, including MySQL, PostgreSQL, and MongoDB, and have a solid understanding of data structures and algorithms.\n\nIn my previous roles at ThoughtWorks, KAS Commerce, and Amazon, I have demonstrated my ability to work with customers to integrate their data, build data pipelines, and develop custom applications. I have also showcased my problem-solving skills by optimizing API response time, implementing automated workflows, and reducing technical debt. My experience with cloud computing platforms like AWS has enabled me to design and deploy scalable and secure systems.\n\nI am particularly drawn to Palantir's mission and values, which emphasize innovation, teamwork, and customer satisfaction. As someone who is passionate about using technology to drive positive change, I am excited about the opportunity to join a company that shares my values and is committed to making a meaningful impact.\n\nThank you for considering my application. I would welcome the opportunity to discuss my qualifications further and explain in greater detail why I am the ideal candidate for this role. Please feel free to contact me at +1 (513)-372-5745 or suprajasrikanth872@gmail.com.\n\nSincerely,\nSupraja Srikanth"
  ],
  [
    "https://jobs.lever.co/palantir/e27af7ab-41fc-40c9-b31d-02c6cb1c505c",
    "Dear Hiring Manager at Palantir, I am excited to apply for the Forward Deployed Software Engineer role at Palantir, where I can utilize my technical skills and experience to help organizations make better decisions by integrating, analyzing, and visualizing their data. With a strong foundation in software development, data integration, and cloud computing, I am confident in my ability to work with customers to build data pipelines and develop custom applications. My experience as an Application Developer at ThoughtWorks has provided me with a solid understanding of software design patterns, and I have successfully engineered bill notifications and alerts within a distributed autopay platform using Spring Boot and Java. I have also optimized API response time for Stripe transactions and implemented Amazon OAuth for user registration and authentication. As a detail-oriented and innovative individual with a passion for problem-solving, I am well-equipped to handle the responsibilities and requirements of this role. I am impressed by Palantir's mission to help organizations make better decisions and its commitment to innovation, teamwork, and customer satisfaction. I am excited about the opportunity to join a team that values these principles and is dedicated to making a positive impact. Thank you for considering my application. I would welcome the opportunity to discuss my qualifications further and explore how my skills and experience align with the needs of the Forward Deployed Software Engineer role at Palantir. Sincerely, Supraja Srikanth"
  ]
]